"""[Midterm] Restaurant"""
def main():
    """main"""
    price = float(input())
    pricepro = float(input())
    discount = (100-float(input()))/100
    offer = float(input())
    billoffer = price + offer
    if billoffer >= pricepro:
        billoffer = billoffer *discount

    if price >= pricepro:
        price = pricepro*discount

    if billoffer < price:
        print('Yes %.3f'%abs(price - billoffer))
    elif billoffer > price:
        print('No %.3f'%abs(price - billoffer))
    else:
        print('Yes')
main()
# Eve เป็นคนรักอาหารทะเลเป็นชีวิตจิตใจจึงได้ตระเวนไป
# ตามร้านอาหารต่างๆเพื่อทานอาหารทะเลที่ชื่นชอบ โดยจะเน้นเลือกร้านที่มีโปรโมชันเพื่อประหยัดค่าใช้จ่าย

# ตัวอย่างเช่น วันหนึ่งหลังจากเธออิ่มหนำสำราญจากอาหารมื้อใหญ่ เมื่อเธอเรียกพนักงานมาเช็คบิลก็พบว่าเธอสั่งอาหารไป 870 บาท (a บาท) แต่ร้านกำหนดว่า ถ้าทานครบ 1000 บาท (b บาท) เธอก็จะได้ใช้โปรโมชันพิเศษจากทางร้าน
# นั่นก็คือ "รับส่วนลดพิเศษ 15% (c %)" พนักงานจึงได้เสนอให้
# Eve สั่งมาการิต้าเพิ่มอีก 1 แก้ว มูลค่า 139 บาท (d บาท) เพื่อที่จะได้รับโปรโมชันดังกล่าว แต่ Eve มีความหลังที่ไม่ดีนักกับโปรโมชันลักษณะนี้ เพราะบ่อยครั้งที่ Eve รู้สึกการต้องจ่ายค่าอาหาร/เครื่องดื่มเพิ่ม ไม่คุ้มกับส่วนลดที่ได้รับ

# Eve จึงขอร้องให้คุณช่วยเขียนโปรแกรมเพื่อคำนวณว่าการสั่งอาหารเพิ่มตามที่ร้านค้าแนะนำนั้นคุ้มค่าหรือไม่ โดยมีสิ่งที่ Eve นำมาพิจารณา ดังนี้
# ราคาอาหารที่ต้องจ่ายตอนแรก a บาท
# ร้านมีโปรโมชันเมื่อทานอาหารครบ b บาทจะได้รับส่วนลด c % ของราคาอาหารรวมทั้งหมด
# ราคาของอาหารที่ร้านอาหารแนะนำให้สั่งเพิ่มเติมอีก d บาท
# โดย Eve อยากให้คุณแสดงผลว่าการสั่งอาหารนั้นเพิ่มคุ้มค่าหรือไม่
# 4 บรรทัด เป็นจำนวนจริงที่ไม่เป็นลบ

#input
# a {a > 0}
# b {b >= a}
# c {0 <= c <= 100}
# d ​{d >= 0}

#output
# 1 บรรทัด
# Yes เว้นวรรค และตามด้วยจำนวนเงินที่ได้ลดราคา หากสั่งอาหารเพิ่มเติม (ตอบเป็นทศนิยม 3 ตำแหน่ง)

# หรือ

# No เว้นวรรค และตามด้วยจำนวนเงินที่ต้องจ่ายเพิ่ม หากสั่งอาหารเพิ่มเติม (ตอบเป็นทศนิยม 3 ตำแหน่ง)

# หรือ

# ถ้าไม่ได้ลดราคาหรือจ่ายเพิ่มจากเดิม ถือว่าคุ้ม เพราะได้กินเพิ่ม ให้ตอบ Yes อย่างเดียวพอ