"""RockPaperScissor"""
def main():
    '''main'''
while pointa>




main()
# การแข่งขัน เป่ายิ้งฉุบระหว่างนาย A กับ B สามารถเขียนได้ดังนี้
# RP หมายถึง นาย A ออก Rock (ค้อน) และ นาย B ออก Paper (กระดาษ) ดังนั้นนาย B ชนะนาย A และนาย B ได้ 1 คะแนน
# SP หมายถึง นาย A ออก Scissor (กรรไกร) และ นาย B ออก Paper (กระดาษ) ดังนั้นนาย A ชนะนาย B และนาย A ได้ 1 คะแนน
# PR หมายถึง นาย A ออก Paper (กระดาษ) และ นาย B ออก Rock (ค้อน) ดังนั้นนาย A ชนะนาย B และนาย A ได้อีก 1 คะแนน เป็น 2 คะแนน
# ถ้านำเอาการเป้ายิ้งฉุบทั้งหมดข้างต้นมาเขียนเรียงต่อกันได้เป็น
# RPSPPR 
# จะสรุปได้ว่า นาย A เป็นผู้ชนะด้วยคะแนน 2 ต่อ 1

 