"""main"""
def main():
    """main"""
    age = int(input())
    ccc = int(input())
    ans = 0
    # if age > 4000000:
    #     ans += (age-4000000)*35/100
    #     age -= age-4000000
    # if age > 2000000 and age <= 4000000:
    #     ans += (age-2000000)*30/100
    #     age -= age-2000000
    # if age > 1000000 and age <= 2000000:
    #     ans += (age-1000000)*25/100
    #     age -= age-1000000
    # if age > 750000 and age <= 1000000:
    #     ans += (age-750000)*20/100
    #     age -= age-750000
    # if age > 500000 and age <= 750000:
    #     ans += (age-500000)*15/100
    #     age -= age-500000
    # if age > 300000 and age <= 500000:
    #     ans += (age-300000)*10/100
    #     age -= age-300000
    # if age > 150000 and age <= 300000:
    #     ans += (age-150000)*5/100
    #     age -= age-150000
    # print(int(ans))
    if ccc > 1800:
        ccc -= 1800
        ans += ccc*4
        print('+++%d'%ccc)
        print('ans:%d'%ans)
    if ccc >= 601 and ccc <= 1800:
        ccc = ccc - 600
        ans += 1800
        print('+++%d'%ccc)
        print('ans:%d'%ans)
    if ccc >= 1 and ccc <= 600:
        ccc -= 1
        if ans = 
        ans += 300
        print('+++%d'%ccc)
        print('ans:%d'%ans)
    print('%.2f'%ans)

main()
# 1-600 cc – cc ละ 50 สตางค์
# 601-1800 cc – cc ละ 1.50 บาท
# 1801 cc ขึ้นไป – cc ละ 4 บาท
# อายุการใช้งาน 6 ปี จะได้รับส่วนลดค่าภาษี 10%
# อายุการใช้งาน 7 ปี จะได้รับส่วนลดค่าภาษี 20%
# อายุการใช้งาน 8 ปี จะได้รับส่วนลดค่าภาษี 30%
# อายุการใช้งาน 9 ปี จะได้รับส่วนลดค่าภาษี 40%
# อายุการใช้งาน 10 ปี ขึ้นไป จะได้รับส่วนลดค่าภาษี 50%
# ช่วง 600 cc แรก / cc ละ 50 สตางค์ = 600 x 0.5 = 300 บาท
# ช่วง 601-1800 cc / cc ละ 1.50 บาท = (1,800 – 600) = 1200 x 1.50 = 1,800 บาท
# ส่วนที่เกินจาก 1800 cc / cc ละ 4 บาท = (2,979 – 1,800) x 4 = 1179 x 4.00 = 4,716 บาท
# รวมค่าภาษีทั้งหมดที่ต้องจ่าย = 300 + 1,800 + 4,716 บาท = 6,816 บาท
#ทำข้ออื่นรอเลยก็ได้ เรางงข้อนี้แปป

# ข้อ Pro ผ่านแล้วนะะ